In [1]:
import pandas as pd

In [15]:
df_test = pd.DataFrame({'id': [1,1,2,1,2,3,3,3,4,5,6,2,3, 4],
                        'class': ['car', 'car', 'car', 'motorbike', 'bicycle', 'person', 'person', 'car', 'motorbike', 'person', 'bicycle', 'bicycle', 'bicycle', 'bicycle'],
                        'conf': [0.2, 0.2, 0.5, 0.001, 0.02, 0.6, 0.8, 0.8, 0.2, 0.3, 0.5, 0.001, 0.02, 0.6]
                       })

In [16]:
df_test

    id      class   conf
0    1        car  0.200
1    1        car  0.200
2    2        car  0.500
3    1  motorbike  0.001
4    2    bicycle  0.020
5    3     person  0.600
6    3     person  0.800
7    3        car  0.800
8    4  motorbike  0.200
9    5     person  0.300
10   6    bicycle  0.500
11   2    bicycle  0.001
12   3    bicycle  0.020
13   4    bicycle  0.600

In [31]:
df_test_agg = df_test.loc[df_test['conf'] > 0.1].groupby(['id', 'class'])['conf'].count().reset_index(name='count')

In [30]:
df_test.columns

Index(['id', 'class', 'conf'], dtype='object')

In [33]:
df_test_agg['count'].sum()

10

In [34]:
df_test_agg

   id      class  count
0   1        car      2
1   2        car      1
2   3        car      1
3   3     person      2
4   4    bicycle      1
5   4  motorbike      1
6   5     person      1
7   6    bicycle      1

In [36]:
df_test_agg.groupby('class')[['id', 'count']].sum().reset_index()

       class  id  count
0    bicycle  10      2
1        car   6      4
2  motorbike   4      1
3     person   8      3